app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def index
		@posts = Post.all

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "qwe"], ["content", "qwe"], ["created_at", "2018-03-26 12:54:13.149074"], ["updated_at", "2018-03-26 12:54:13.149074"]]
---
	def create
		@post = Post.new(params[:post])

		if @post.save